/*Задача 15: Напишите программу, которая принимает на вход цифру, 
обозначающую день недели, и проверяет, является ли этот день выходным.
6 -> да
7 -> да
1 -> нет
*/

using static System.Console;
Clear();

Write("Введите число обозначающее день недели (от 1 до 7): ");
int Number = int.Parse(ReadLine()!);

if (Number >= 1 && Number <= 5)
{
    WriteLine("Это рабочий день");
}
else if (Number >= 6 && Number <= 7)
{
    WriteLine("Это выходной день");
}
else
{
    WriteLine("Вы ввели некорректное число");
}
